Autodesk.Revit.DB.FormaTriangleMesh.PickBestFormaTriangleMeshForPolylines(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.UV}},System.Collections.Generic.IList{Autodesk.Revit.DB.FormaTriangleMeshArr})
Returns the index into terrainGroups of the FormaTerrains group whose combined 2D boundary
polygon has the greatest intersection area with the given polylines boundary polygon.
Returns -1 when either input is empty or no valid boundary can be computed.
polylines:
Boundary polylines of the parcel or road, in the same XY coordinate space as the terrain.
meshGroups:
Candidate terrain groups to rank; each group is one representation, already scaled to feet.
Returns:
Index of the best-matching group, or -1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormaTriangleMesh.ClampPolylinesToTerrain(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.UV}},System.Collections.Generic.IList{Autodesk.Revit.DB.FormaTriangleMesh})
Drapes open 2D polylines onto the terrain using the same elevation rule as
clampRegionsToTerrain: each vertex is vertically projected onto the surface and
each segment is subdivided at terrain-triangle-edge crossings, with NO triangulation.
Falls back to flat Z = 0 when there is no terrain.
polylines:
Each inner Arr<UV> is one open polyline (ordered points).
terrainMeshes:
Target terrain, already scaled to feet (XY and Z).
Returns:
Flat LINE LIST for DirectContext3D LineList: consecutive (p0,p1) pairs per segment.
Empty on failure (a DBG_WARN is issued).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormaTriangleMesh.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaTriangleMesh.#ctor(Autodesk.Revit.DB.FormaTriangleMesh)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormaTriangleMesh.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Int32})
Construct from mesh data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormaTriangleMesh
Indexed triangle mesh: a point pool and flat triangle index array (3 sequential indices
per triangle). Used as the elevation reference for road/parcel clamping and as the per-road
clamped surface produced by FormaRoad::clampRegionsToTerrain.